tg-bot/ШаблонБота/src/Documents/Спасибо/Спасибо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Спасибо</name>
  <registerRecords>AccumulationRegister.БалансПользователя</registerRecords>
  <attributes>
    <name>КтоПоблагодарил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КогоПоблагодарил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаЧтоПоблагодарил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

tg-bot/ШаблонБота/src/AccumulationRegisters/БалансПользователя/БалансПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БалансПользователя</name>
  <resources>
    <name>Золото</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Серебро</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

tg-bot/ШаблонБота/src/Documents/Спасибо/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ)
	
	Движения.БалансПользователя.Записывать = Истина;
	
	Стоимость = ОбщийМодульСерверПовтИсп.СтоимостьСпасибо(Дата);
	
	Движение = Движения.БалансПользователя.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.ФизическоеЛицо = КогоПоблагодарил;
	Движение.Золото = Стоимость.Золото;
	Движение.Серебро = Стоимость.Серебро;
	
КонецПроцедуры

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
